[
    {
      "name": "LAWRENCE & CHERRY",
      "testimonial": "“Your acoustic renditions of our favorite songs were simply perfect and memorable.”"
    },
    {
      "name": "GABRIELLE",
      "testimonial": "“Our wedding MVPs! The star of the night. We’re such a big fan!! We love you guys”"
    },
    {
      "name": "CHARMAINE",
      "testimonial": "“Getting serenaded by Frigora while walking down the aisle is one of the best decisions.”"
    },
    {
      "name": "LOUISE ANCHORIZ",
      "testimonial": "“Dream come true to hear you perform live.”"
    },
    {
      "name": "PATRICIA LAO",
      "testimonial": "“I’m very particular when it comes to music & Frigora exceeded my expectations!”"
    },
    {
      "name": "MAIPHEE",
      "testimonial": "“They sing like angels as the skies open up. The sound was pure and calms the heart.”"
    },
    {
      "name": "RISSA",
      "testimonial": "“Thank you for making our Church ceremony so solemn and beautiful. It was PERFECT!!!!”"
    },
    {
      "name": "GIN",
      "testimonial": "“My husband can be quite technical and particular when it come so music as he plays certain instruments, and boy, was he impressed!”"
    },
    {
      "name": "ALLAN & MIRA",
      "testimonial": "“We have not yet moved on with the stellar performance that you gave us on our wedding day. You raised the ceremony and reception on a whole new level that we never imagined. All the guests have the same feedback: That was a concert-level performace”"
    },
    {
      "name": "ROY & CHINA",
      "testimonial": "“Non-negotiable talaga. Tanggaling mo na lahat. Frigora lang ang cannot. Kasi king hindi kayo pwede ng day na to, we will move the event… No one can perform yung level na gusto ko. This is a dream come true!”"
    },
    {
      "name": "MARIELLE MAGTIBAY",
      "testimonial": "“Everyone was raving about how talented and professional the band was. Definitely set the party mood of our reception and made our day extra special! Thank you for making our day very memorable for everybody.”"
    },
    {
      "name": "NICO & CY",
      "testimonial": "“Words are merely not enough to summarize the experience that my wife, I, and all those present during our wedding ceremony and reception. Their renditions of our chosen songs were breathtakingly magical.”"
    },
    {
      "name": "JOJO & KRISTINE",
      "testimonial": "“Our wedding guest noted \"this band takes the effort to have a unique musical arrangement on every cover\". Totally agree! The performances does justice to the songs but also comes out uniquely with their style… When guests tell you \"galing ng band niyo\" its really special and it feels great to know that they enjoyed the wedding reception.”"
    },
    {
      "name": "JM & MIKEE",
      "testimonial": "“We had to change our vocalist twice bc of the COVID surge. I was not able to listen to the new vocalist they recommended since it’s a super last minute change but we know Frigora will deliver. I couldn’t be any happier that I was able to book the team. They made the whole place jam to them even though we only booked a trio. Everyone was soooo amazed! I can’t even put into words how much I loooove them. Until next time”"
    },
    {
      "name": "EM-EM & BENJAMIN",
      "testimonial": "“The feeling I felt when I first heard you is the same, if not even better!! You were our non negotiable supplier.”"
    },
    {
      "name": "ZEL & JORGE",
      "testimonial": "“They were not just \"entertainment\", they made us feel light, soulful and refreshed during the busy day. I've seen a lot of wedding and cover bands perform being a fan of live music myself, but Frigora goes deep and nourishes your soul through music. This sets them apart. Easily one of our best decisions during our wedding.”"
    },
    {
      "name": "RIA TANIGUCHI",
      "testimonial": "“Thank you Frigora for the lovely music you blessed our wedding with. From the bridal march that added to all the emotional feels to that last set where you made all our guests sing along! Cheers to our family's go to wedding band!”"
    },
    {
      "name": "SAMANTHA DELA CRUZ",
      "testimonial": "“The moment I heard my bridal march song, I knew we made the right choice with Frigora. Hearing them in the church ceremony gave me goosebumps hearing them play our first dance song exactly how the choreographer cut the music amazed me. During the dinner set, I had to turn my head a few times while going around tables while our photos were being taken because they were just too good. But the absolute best part was the after party set AND the after party set extension! They killed it! Our guests (young AND old) went wild and kept asking for more. Everyone was complementing us about Frigora Acoustic to the point that some guests booked them the day after! Thank you for being the life of the party!”"
    },
    {
      "name": "CATH SECRETARIO",
      "testimonial": "“From our Church ceremony to the reception, Frigora was a crowd favorite! The band made a beautiful arrangement for my bridal march and when they sang the first line to the song after our first kiss as husband and wife, I was so impressed by the timing of the first line that I really had to look for them! It was perfect! We loved them so much we even had them stay for an extension set... twice!”"
    },
    {
      "name": "DOM & BERNICE",
      "testimonial": "“The best choice for our Church ceremony and reception!!! You guys are simply the best!!! Since the very first time we heard you guys perform last January, up to the time you serenade us on our wedding day, gaaahd, you keep getting better and better!!!"
    },
    {
      "name": "BRIANA VERGARA",
      "testimonial": "“Frigora was amazing and I loved everything about them! Thank you so much for being our main entertainment. Everyone was so impressed with your performance!”"
    },
    {
      "name": "LEONARD ",
      "testimonial": "“Finally, my dream in seeding Frigora came true. It’s different watching Youtube videos and then hearing it on my wedding day. The first and only supplier I picked.”"
    },
    {
      "name": "BEN & SARAH",
      "testimonial": "“We’re such a fan!! Def grabbing you guys again on our next life event. Our wedding wouldn’t be so gorgeous without your music.”"
    },
    {
      "name": "DEIMANTE",
      "testimonial": "“From the moment I entered the Church, I knew it was the best decision to choose your band. Everything was perfect! All our guests were amazed by the quality and repertoire of the music.”"
    },
    {
      "name": "JEFF & ANA",
      "testimonial": "“So blow away by your team, Frigora! Music is so important to us and you made our dreams come true.”"
    },
    {
      "name": "RON & VAL",
      "testimonial": "“Of all that happened in our wedding, you guys are one of the things we didn’t regret. You are so good! Hearing you guys live.. WOW. Speechless. All I can say is “The best!! WORTH IT!”"
    },
    {
      "name": "CONNOR & NELLE",
      "testimonial": "“Frigora, what can I say! The timbre of the music was sincere and beautiful. And saving the day during our First Dance when the file was lost was heroic. Performing spontaneously without rehearsal, the tempo of the music for our First Dance was perfect, and it meant so much to us in that moment. It was a lot of fun and a great moment for us to relax within such a busy day.”"
    }
   ]